posts/HTLC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Exploring the World of HTLCs: Challenges and Innovations</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/asset/css/style.css"/><link rel="stylesheet" href="/asset/css/prism.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Exploring the World of HTLCs: Challenges and Innovations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#what-are-htlcs">So What are HTLCs</a></li>
<li><a href="#problems-with-htlcs">Problems with HTLCs</a></li>
<li><a href="#orgb632b3e">Adaptor Signatures</a></li>
</ul>
</div>
</div>
<p>
A while back, I watched an almost decade old <a href="https://www.youtube.com/watch?v=nPvfn138PRg">video</a> produced by the Zcash team. It demonstrated a way to atomically swap zcash tokens for Bitcoins. Despite seeing the problems of that approach in real time, I wondered why these issues weren't eventually resolved and the idea more broadly adopted. Let's just say that you don't see multiple HTLC based protocol clones across multiple chains. However, there are still a few notable protocols that have recognised the utility of HTLCs as a fundamental component.
</p>

<p>
These include the <a href="https://lightning.network/">Lightening network</a>, which uses HTLCs for state channel payments, and the <a href="https://unstoppableswap.net/">Monero - Bitcoin atomic swap</a>, an example of peer-to-peer atomic cross-chain swaps. Additionally, <a href="https://airswap.io">Airswap</a>, an OTC and RFQ based protocol, employs the HTLC primitive to facilitate non-custodial trading. This selective adoption highlights the specific scenarios where HTLCs are considered beneficial despite their apparent limitations in other contexts."
</p>

<div id="outline-container-what-are-htlcs" class="outline-2">
<h2 id="what-are-htlcs">So What are HTLCs</h2>
<div class="outline-text-2" id="text-what-are-htlcs">
<p>
Hash time locked contracts are a type of smart contract, that creates a
time based escrow that users can trade tokens in a peer-to-peer fashion,
by revealing the secret to a hash to unlock the tokens.
</p>

<p>
Let's break that down a little bit further.
</p>

<p>
The basic essence of a HTLC is such that a user is able to trade their tokens with another user in such a way that if anything goes wrong there is no risk to losing their assets.
</p>

<p>
The basic process of a HTLC is such:
</p>

<ol class="org-ol">
<li>Aisha chooses a secret \(x\) and produces \(H(x)\), a hash value of x. She then
locks her coins with the hash for time \(T\).</li>
<li>Umar locks his coins using the hash value generated by Aisha for
time \(T\).</li>
<li>Aisha publishes her secret \(x\) to take Umar's coins before \(T\) expires.</li>
<li>Umar now knows secret \(x\) and can then use that to take Aisha coins
before \(T\) expires.</li>
</ol>
</div>
</div>


<div id="outline-container-problems-with-htlcs" class="outline-2">
<h2 id="problems-with-htlcs">Problems with HTLCs</h2>
<div class="outline-text-2" id="text-problems-with-htlcs">
<p>
HTLCs function similarly to a free american call option, which tends to disadvantage the initiator of the swap. This is because the counterparty has the option to walk away from the transaction at any time, leaving the initiator to wait until the contract expires to reclaim their coins. To counter this, one solution could be to require the counterparty to pay a small, non-refundable fee to the initiator. Alternatively, implementing a dynamic pricing mechanism that increases the transaction cost over time could deter this behaviour.
</p>

<p>
Scaling HTLCs presents another challenge, as they require a direct counterparty and communication channel for each trade. This setup is not ideal for transactions involving long-tail assets due to the difficulty in finding a willing counterparty. A potential solution to this issue is to establish a batch auction system for HTLCs, allowing the processing of multiple bids and asks within a set timeframe.
</p>

<p>
Privacy in HTLC-based atomic swaps is also a concern. The transactions can be easily traced by analysing the hash function on both chains. Adaptor signatures offer a way to address this privacy issue by preventing the leak of the hash pre-image on the chain.
</p>

<p>
So this leads to the question of what are adaptor signatures and are they actually any better?
</p>
</div>
</div>

<div id="outline-container-orgb632b3e" class="outline-2">
<h2 id="orgb632b3e">Adaptor Signatures</h2>
<div class="outline-text-2" id="text-orgb632b3e">
<p>
Adaptor Signatures were first mentioned by Andrew Poelstra in an article titled <a href="https://github.com/BlockstreamResearch/scriptless-scripts/tree/master">Scriptless Scripts: How Bitcoin Can Support Smart Contracts Without Smart Contracts</a>. This article explained how to use adaptor signatures as an alternative to HTLCs to perform atomic swaps that offer greater privacy protections.
</p>

<p>
An adaptor signature is basically a schnorr signature with an added piece of hidden information. For reminding, this is a schnorr signature:
</p>

<p>
\[ s = r + H(P || R || m) P\]
</p>

<p>
where:
</p>
<ul class="org-ul">
<li>\(H\) is the hash function.</li>
<li>\(m\) is the message.</li>
<li>\(r\) is a random number</li>
<li>\(R = rG\) is the x-coordinate of the random point and G is the generator point.</li>
</ul>

<p>
A great property of the schnorr signature is that it is made up of purely linear terms that make it possible for it to easily construct multi-party signatures by just adding them together.
</p>

<p>
The adaptor signature is created by introducing a secret t in the signature calculation as:
</p>

<p>
\[ s' = t + schnorr\] which breaks down further to \[ s' = t + r + H(P || R || m) P\]
</p>

<p>
where:
</p>
<ul class="org-ul">
<li>\(t\) is a secret key</li>
</ul>

<p>
Decrypting the signature and finding out the secret would require the original signature and the adapted signature.
</p>

<p>
\[t = s' - s\]
</p>

<p>
Back to the original example, this time both parties would engage in a trade for 1 BTC for 10 LTC  using a cross-chain atomic swap.
</p>

<ol class="org-ol">
<li>Aisha locks 1 BTC in a multi-sig address. Umar locks 10LTC in another multi-sig address. Both parties create a combined public key that's indistinguishable from any other schnorr public key, (including being the same size).</li>

<li>Aisha creates an adaptor schnorr signature \(s_{a}^{'}\) by choosing a random number t and then passes that to Umar along with the public key generated, \((s_{a}^{'}, T)\).</li>

<li><p>
Umar verifies the adaptor schnorr signature and adds his adaptor signature and passes that to Aisha.
</p>

<p>
\[S_{ab}^{'} = s_{a}^{'} + s_{u} = t + r_{a} + r_{b} + H(R|P|m)(p_{a} + p_{b})\]
</p></li>

<li>Aisha verifies the signature from Umar and decrypts the adaptor schnorr signature using \(t\).</li>

<li>To claim Aisha completes her signature using her secret \(t\) and her part of the multisig resulting in \(s_{ab}^{'} - t\). By broadcasting this transaction she reveals \(t\) to Umar and now Umar can calculate \(t\) himself from subtracting Aisha's complete signature \(s_{ab}\) from the adaptor signature, \(t = s_{ab}^{'} - s_{ab}\). Using \(t\) Umar completes his signature for the BTC transaction and claims his BTC.</li>
</ol>


<p>
In conclusion, Hash Time Locked Contracts (HTLCs) offer a unique approach to decentralized token trading but face challenges in terms of balance, scalability, and privacy. Innovations like adaptor signatures, incorporating encrypted schnorr signatures, offer a compelling alternative. They enhance privacy and could revolutionize atomic swaps. The future of blockchain technology hinges on balancing scalability, security, and privacy, with adaptor signatures potentially key to overcoming HTLCs' limitations. Continued research and development will determine their impact on secure, private blockchain transactions, reflecting the dynamic nature of this technological field.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>